START_TEXT = "Выберите интересующий раздел👇🏻"
ANY_TEXT = "Выберите интересующий раздел👇🏻"

ADMIN_BTN = "Админ панель"
BACK_BTN = "Назад"
STATS_BTN = "Статистика"

MASS_SEND_BTN = "Массовая рассылка"
SEND_USERS_BTN = "Отправить рассылку"
OK_BTN = "Отправить"

ADMIN_WAIT_MASS_MSG_TEXT = (
    "<b>Массовая рассылка</b>\n\n"
    "Отправьте сообщение, которое хотите разослать пользователям"
)

ADMIN_CHECK_POST_TEXT = (
    "<b>Проверьте пост перед отправкой</b>\n\n"
    "Если всё верно, нажмите \"Отправить\", чтобы начать рассылку"
)

ADMIN_MASS_MAIL_START_TEXT = (
    "<b>Начинаю рассылку по {} пользователям...</b>\n\n"
    "Пожалуйста, подождите, это может занять некоторое время."
)

ADMIN_MASS_MAIL_END_TEXT = "<b>Рассылка завершена!</b>"